bezier_foil/system/blockMeshDict
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				dictionary;
		object			blockMeshDict;
}

// ***************************************************************************** //

scale				1;

vertices
(
		(-1.0 0.0 -0.5)	//	0
		(-1.0 0.0 0.5)	//	1
		(0.0 0.0 -0.5)	//	2
		(0.0 0.0 0.5)	//	3
		(8.0 25.0 -0.5)	//	4
		(8.0 25.0 0.5)	//	5
		(-26.248809496813376 0.0 -0.5)	//	6
		(-26.248809496813376 0.0 0.5)	//	7
		(8.0 -25.0 -0.5)	//	8
		(8.0 -25.0 0.5)	//	9
		(25.0 -25.0 -0.5)	//	10
		(25.0 -25.0 0.5)	//	11
		(25.0 0.0 -0.5)	//	12
		(25.0 0.0 0.5)	//	13
		(25.0 25.0 -0.5)	//	14
		(25.0 25.0 0.5)	//	15
		(0.0 0.0 -0.5)	//	16
		(0.0 0.0 0.5)	//	17
);

blocks
(
		hex ( 0  2  4  6  1  3  5  7 ) (40 60 1) edgeGrading (((.5 .5 10) (.5 .5 0.1))   0.1   0.1   ((.5 .5 10) (.5 .5 0.1)) 10000 1000 1000 10000 1 1 1 1) // 0
		hex ( 6  8 16  0  7  9 17  1 ) (40 60 1) edgeGrading (0.1   ((.5 .5 10) (.5 .5 0.1))   ((.5 .5 10) (.5 .5 0.1))   0.1 0.0001 0.001 0.001 0.0001 1 1 1 1) // 1
		hex ( 8 10 12 16  9 11 13 17 ) (40 60 1) edgeGrading ( 1 1200 1200 1 0.001 0.01 0.01 0.001 1 1 1 1 ) // 2
		hex ( 2 12 14  4  3 13 15  5 ) (40 60 1) edgeGrading ( 1200 1 1 1200 1000 100 100 1000 1 1 1 1 ) // 3
);

edges
(
		arc  4  6  (-15.475941393425684 21.20130274269139 -0.5)
		arc  5  7  (-15.475941393425684 21.20130274269139 0.5)
		arc  6  8  (-15.475941393425684 -21.20130274269139 -0.5)
		arc  7  9  (-15.475941393425684 -21.20130274269139 0.5)
		spline 0  2 (
							(-0.99940743  0.01038586 -0.5       )
							(-0.99776217  0.02030664 -0.5       )
							(-0.99513566  0.02977593 -0.5       )
							(-0.99159629  0.03880701 -0.5       )
							(-0.98720943  0.04741286 -0.5       )
							(-0.98203758  0.0556062  -0.5       )
							(-0.97614038  0.06339942 -0.5       )
							(-0.9695747   0.07080466 -0.5       )
							(-0.96239472  0.07783375 -0.5       )
							(-0.95465198  0.08449827 -0.5       )
							(-0.94639548  0.09080952 -0.5       )
							(-0.93767172  0.09677853 -0.5       )
							(-0.92852479  0.10241606 -0.5       )
							(-0.9189964   0.10773262 -0.5       )
							(-0.909126    0.11273847 -0.5       )
							(-0.8989508   0.11744358 -0.5       )
							(-0.88850588  0.12185771 -0.5       )
							(-0.8778242   0.12599036 -0.5       )
							(-0.8669367   0.12985077 -0.5       )
							(-0.85587237  0.13344798 -0.5       )
							(-0.84465828  0.13679074 -0.5       )
							(-0.83331968  0.13988761 -0.5       )
							(-0.82188     0.14274689 -0.5       )
							(-0.81036101  0.14537669 -0.5       )
							(-0.79878277  0.14778484 -0.5       )
							(-0.78716377  0.149979   -0.5       )
							(-0.77552094  0.15196658 -0.5       )
							(-0.76386974  0.15375479 -0.5       )
							(-0.75222419  0.15535063 -0.5       )
							(-0.74059695  0.15676085 -0.5       )
							(-0.72899936  0.15799206 -0.5       )
							(-0.71744149  0.15905059 -0.5       )
							(-0.70593223  0.15994264 -0.5       )
							(-0.69447928  0.16067414 -0.5       )
							(-0.68308926  0.16125088 -0.5       )
							(-0.67176775  0.16167841 -0.5       )
							(-0.66051932  0.16196211 -0.5       )
							(-0.64934759  0.16210718 -0.5       )
							(-0.63825529  0.16211859 -0.5       )
							(-0.6272443   0.16200116 -0.5       )
							(-0.61631571  0.16175951 -0.5       )
							(-0.60546985  0.16139808 -0.5       )
							(-0.59470634  0.16092112 -0.5       )
							(-0.58402416  0.16033271 -0.5       )
							(-0.57342167  0.15963676 -0.5       )
							(-0.56289666  0.15883697 -0.5       )
							(-0.5524464   0.15793691 -0.5       )
							(-0.54206768  0.15693994 -0.5       )
							(-0.53175687  0.15584926 -0.5       )
							(-0.52150992  0.15466792 -0.5       )
							(-0.51132245  0.15339878 -0.5       )
							(-0.50118977  0.15204453 -0.5       )
							(-0.4911069  0.1506077 -0.5      )
							(-0.48106864  0.14909066 -0.5       )
							(-0.47106962  0.14749561 -0.5       )
							(-0.46110427  0.1458246  -0.5       )
							(-0.45116695  0.14407949 -0.5       )
							(-0.44125192  0.142262   -0.5       )
							(-0.43135338  0.14037369 -0.5       )
							(-0.42146555  0.13841597 -0.5       )
							(-0.41158267  0.13639006 -0.5       )
							(-0.40169903  0.13429705 -0.5       )
							(-0.39180903  0.13213787 -0.5       )
							(-0.38190717  0.12991328 -0.5       )
							(-0.37198813  0.12762389 -0.5       )
							(-0.36204678  0.12527017 -0.5       )
							(-0.3520782   0.12285241 -0.5       )
							(-0.34207772  0.12037077 -0.5       )
							(-0.33204096  0.11782523 -0.5       )
							(-0.32196384  0.11521564 -0.5       )
							(-0.31184261  0.11254168 -0.5       )
							(-0.30167389  0.10980288 -0.5       )
							(-0.29145469  0.10699862 -0.5       )
							(-0.28118242  0.10412813 -0.5       )
							(-0.27085494  0.10119047 -0.5       )
							(-0.26047058  0.09818455 -0.5       )
							(-0.25002814  0.09510915 -0.5       )
							(-0.23952695  0.09196287 -0.5       )
							(-0.22896685  0.08874415 -0.5       )
							(-0.21834825  0.0854513  -0.5       )
							(-0.20767211  0.08208245 -0.5       )
							(-0.19694003  0.0786356  -0.5       )
							(-0.18615417  0.07510856 -0.5       )
							(-0.17531736  0.07149902 -0.5       )
							(-0.16443306  0.06780447 -0.5       )
							(-0.15350541  0.06402228 -0.5       )
							(-0.14253923  0.06014964 -0.5       )
							(-0.13154004  0.05618357 -0.5       )
							(-0.12051407  0.05212096 -0.5       )
							(-0.10946828  0.04795851 -0.5       )
							(-0.09841039  0.04369276 -0.5       )
							(-0.08734885  0.03932009 -0.5       )
							(-0.0762929   0.03483672 -0.5       )
							(-0.06525256  0.0302387  -0.5       )
							(-0.05423863  0.0255219  -0.5       )
							(-0.04326271  0.02068203 -0.5       )
							(-0.03233723  0.01571463 -0.5       )
							(-0.02147544  0.01061506 -0.5       )
							(-0.01069139  0.00537851 -0.5       )

						)
		spline 1  3 (
							(-0.99940743  0.01038586  0.5       )
							(-0.99776217  0.02030664  0.5       )
							(-0.99513566  0.02977593  0.5       )
							(-0.99159629  0.03880701  0.5       )
							(-0.98720943  0.04741286  0.5       )
							(-0.98203758  0.0556062   0.5       )
							(-0.97614038  0.06339942  0.5       )
							(-0.9695747   0.07080466  0.5       )
							(-0.96239472  0.07783375  0.5       )
							(-0.95465198  0.08449827  0.5       )
							(-0.94639548  0.09080952  0.5       )
							(-0.93767172  0.09677853  0.5       )
							(-0.92852479  0.10241606  0.5       )
							(-0.9189964   0.10773262  0.5       )
							(-0.909126    0.11273847  0.5       )
							(-0.8989508   0.11744358  0.5       )
							(-0.88850588  0.12185771  0.5       )
							(-0.8778242   0.12599036  0.5       )
							(-0.8669367   0.12985077  0.5       )
							(-0.85587237  0.13344798  0.5       )
							(-0.84465828  0.13679074  0.5       )
							(-0.83331968  0.13988761  0.5       )
							(-0.82188     0.14274689  0.5       )
							(-0.81036101  0.14537669  0.5       )
							(-0.79878277  0.14778484  0.5       )
							(-0.78716377  0.149979    0.5       )
							(-0.77552094  0.15196658  0.5       )
							(-0.76386974  0.15375479  0.5       )
							(-0.75222419  0.15535063  0.5       )
							(-0.74059695  0.15676085  0.5       )
							(-0.72899936  0.15799206  0.5       )
							(-0.71744149  0.15905059  0.5       )
							(-0.70593223  0.15994264  0.5       )
							(-0.69447928  0.16067414  0.5       )
							(-0.68308926  0.16125088  0.5       )
							(-0.67176775  0.16167841  0.5       )
							(-0.66051932  0.16196211  0.5       )
							(-0.64934759  0.16210718  0.5       )
							(-0.63825529  0.16211859  0.5       )
							(-0.6272443   0.16200116  0.5       )
							(-0.61631571  0.16175951  0.5       )
							(-0.60546985  0.16139808  0.5       )
							(-0.59470634  0.16092112  0.5       )
							(-0.58402416  0.16033271  0.5       )
							(-0.57342167  0.15963676  0.5       )
							(-0.56289666  0.15883697  0.5       )
							(-0.5524464   0.15793691  0.5       )
							(-0.54206768  0.15693994  0.5       )
							(-0.53175687  0.15584926  0.5       )
							(-0.52150992  0.15466792  0.5       )
							(-0.51132245  0.15339878  0.5       )
							(-0.50118977  0.15204453  0.5       )
							(-0.4911069  0.1506077  0.5      )
							(-0.48106864  0.14909066  0.5       )
							(-0.47106962  0.14749561  0.5       )
							(-0.46110427  0.1458246   0.5       )
							(-0.45116695  0.14407949  0.5       )
							(-0.44125192  0.142262    0.5       )
							(-0.43135338  0.14037369  0.5       )
							(-0.42146555  0.13841597  0.5       )
							(-0.41158267  0.13639006  0.5       )
							(-0.40169903  0.13429705  0.5       )
							(-0.39180903  0.13213787  0.5       )
							(-0.38190717  0.12991328  0.5       )
							(-0.37198813  0.12762389  0.5       )
							(-0.36204678  0.12527017  0.5       )
							(-0.3520782   0.12285241  0.5       )
							(-0.34207772  0.12037077  0.5       )
							(-0.33204096  0.11782523  0.5       )
							(-0.32196384  0.11521564  0.5       )
							(-0.31184261  0.11254168  0.5       )
							(-0.30167389  0.10980288  0.5       )
							(-0.29145469  0.10699862  0.5       )
							(-0.28118242  0.10412813  0.5       )
							(-0.27085494  0.10119047  0.5       )
							(-0.26047058  0.09818455  0.5       )
							(-0.25002814  0.09510915  0.5       )
							(-0.23952695  0.09196287  0.5       )
							(-0.22896685  0.08874415  0.5       )
							(-0.21834825  0.0854513   0.5       )
							(-0.20767211  0.08208245  0.5       )
							(-0.19694003  0.0786356   0.5       )
							(-0.18615417  0.07510856  0.5       )
							(-0.17531736  0.07149902  0.5       )
							(-0.16443306  0.06780447  0.5       )
							(-0.15350541  0.06402228  0.5       )
							(-0.14253923  0.06014964  0.5       )
							(-0.13154004  0.05618357  0.5       )
							(-0.12051407  0.05212096  0.5       )
							(-0.10946828  0.04795851  0.5       )
							(-0.09841039  0.04369276  0.5       )
							(-0.08734885  0.03932009  0.5       )
							(-0.0762929   0.03483672  0.5       )
							(-0.06525256  0.0302387   0.5       )
							(-0.05423863  0.0255219   0.5       )
							(-0.04326271  0.02068203  0.5       )
							(-0.03233723  0.01571463  0.5       )
							(-0.02147544  0.01061506  0.5       )
							(-0.01069139  0.00537851  0.5       )

						)
		spline 0 16 (
							(-0.99967437 -0.00398529 -0.5       )
							(-0.99869445 -0.00779762 -0.5       )
							(-0.9971019  -0.01143881 -0.5       )
							(-0.99493632 -0.01491085 -0.5       )
							(-0.99223523 -0.01821587 -0.5       )
							(-0.98903418 -0.02135616 -0.5       )
							(-0.98536677 -0.02433417 -0.5       )
							(-0.98126478 -0.02715245 -0.5       )
							(-0.97675816 -0.02981369 -0.5       )
							(-0.9718751  -0.03232071 -0.5       )
							(-0.96664214 -0.03467642 -0.5       )
							(-0.96108417 -0.03688382 -0.5       )
							(-0.95522451 -0.03894603 -0.5       )
							(-0.94908498 -0.04086622 -0.5       )
							(-0.94268591 -0.04264767 -0.5       )
							(-0.93604626 -0.04429371 -0.5       )
							(-0.92918361 -0.04580773 -0.5       )
							(-0.92211425 -0.04719318 -0.5       )
							(-0.91485323 -0.04845355 -0.5       )
							(-0.90741439 -0.04959239 -0.5       )
							(-0.89981043 -0.05061325 -0.5       )
							(-0.89205297 -0.05151975 -0.5       )
							(-0.88415256 -0.0523155  -0.5       )
							(-0.87611876 -0.05300413 -0.5       )
							(-0.86796018 -0.05358929 -0.5       )
							(-0.85968452 -0.05407464 -0.5       )
							(-0.85129863 -0.05446381 -0.5       )
							(-0.84280853 -0.05476044 -0.5       )
							(-0.83421949 -0.05496817 -0.5       )
							(-0.82553603 -0.05509061 -0.5       )
							(-0.81676201 -0.05513133 -0.5       )
							(-0.80790063 -0.0550939  -0.5       )
							(-0.79895448 -0.05498186 -0.5       )
							(-0.78992562 -0.05479868 -0.5       )
							(-0.78081555 -0.05454784 -0.5       )
							(-0.77162531 -0.05423272 -0.5       )
							(-0.7623555  -0.05385669 -0.5       )
							(-0.75300628 -0.05342307 -0.5       )
							(-0.74357747 -0.0529351  -0.5       )
							(-0.73406853 -0.05239597 -0.5       )
							(-0.72447862 -0.05180881 -0.5       )
							(-0.71480665 -0.0511767  -0.5       )
							(-0.70505128 -0.05050263 -0.5       )
							(-0.69521095 -0.04978953 -0.5       )
							(-0.68528395 -0.04904024 -0.5       )
							(-0.67526843 -0.04825755 -0.5       )
							(-0.66516241 -0.04744415 -0.5       )
							(-0.65496384 -0.04660267 -0.5       )
							(-0.64467061 -0.04573564 -0.5       )
							(-0.63428058 -0.04484552 -0.5       )
							(-0.62379163 -0.04393467 -0.5       )
							(-0.61320162 -0.04300538 -0.5       )
							(-0.60250851 -0.04205984 -0.5       )
							(-0.59171031 -0.04110015 -0.5       )
							(-0.58080513 -0.04012833 -0.5       )
							(-0.5697912 -0.0391463 -0.5      )
							(-0.5586669  -0.03815591 -0.5       )
							(-0.54743077 -0.03715888 -0.5       )
							(-0.53608152 -0.03615687 -0.5       )
							(-0.52461808 -0.03515143 -0.5       )
							(-0.51303961 -0.03414404 -0.5       )
							(-0.50134549 -0.03313607 -0.5       )
							(-0.48953537 -0.03212881 -0.5       )
							(-0.47760917 -0.03112344 -0.5       )
							(-0.46556709 -0.03012107 -0.5       )
							(-0.45340966 -0.02912273 -0.5       )
							(-0.4411377  -0.02812933 -0.5       )
							(-0.42875238 -0.02714172 -0.5       )
							(-0.4162552  -0.02616066 -0.5       )
							(-0.40364803 -0.02518682 -0.5       )
							(-0.3909331 -0.0242208 -0.5      )
							(-0.378113   -0.02326311 -0.5       )
							(-0.36519073 -0.02231419 -0.5       )
							(-0.35216967 -0.02137439 -0.5       )
							(-0.3390536  -0.02044402 -0.5       )
							(-0.32584673 -0.01952328 -0.5       )
							(-0.31255365 -0.01861233 -0.5       )
							(-0.2991794  -0.01771127 -0.5       )
							(-0.28572941 -0.01682011 -0.5       )
							(-0.27220959 -0.01593883 -0.5       )
							(-0.25862622 -0.01506734 -0.5       )
							(-0.24498605 -0.01420551 -0.5       )
							(-0.23129627 -0.01335316 -0.5       )
							(-0.21756447 -0.01251006 -0.5       )
							(-0.2037987  -0.01167594 -0.5       )
							(-0.19000744 -0.01085052 -0.5       )
							(-0.1761996  -0.01003347 -0.5       )
							(-0.16238451 -0.00922442 -0.5       )
							(-0.14857194 -0.00842301 -0.5       )
							(-0.13477206 -0.00762885 -0.5       )
							(-0.12099548 -0.00684154 -0.5       )
							(-0.1072532  -0.00606067 -0.5       )
							(-0.09355663 -0.00528585 -0.5       )
							(-0.07991758 -0.00451666 -0.5       )
							(-0.06634825 -0.00375273 -0.5       )
							(-0.0528612  -0.00299369 -0.5       )
							(-0.03946938 -0.0022392  -0.5       )
							(-0.02618609 -0.00148892 -0.5       )
							(-0.01302497 -0.0007426  -0.5       )

						)
		spline 1 17 (
							(-0.99967437 -0.00398529  0.5       )
							(-0.99869445 -0.00779762  0.5       )
							(-0.9971019  -0.01143881  0.5       )
							(-0.99493632 -0.01491085  0.5       )
							(-0.99223523 -0.01821587  0.5       )
							(-0.98903418 -0.02135616  0.5       )
							(-0.98536677 -0.02433417  0.5       )
							(-0.98126478 -0.02715245  0.5       )
							(-0.97675816 -0.02981369  0.5       )
							(-0.9718751  -0.03232071  0.5       )
							(-0.96664214 -0.03467642  0.5       )
							(-0.96108417 -0.03688382  0.5       )
							(-0.95522451 -0.03894603  0.5       )
							(-0.94908498 -0.04086622  0.5       )
							(-0.94268591 -0.04264767  0.5       )
							(-0.93604626 -0.04429371  0.5       )
							(-0.92918361 -0.04580773  0.5       )
							(-0.92211425 -0.04719318  0.5       )
							(-0.91485323 -0.04845355  0.5       )
							(-0.90741439 -0.04959239  0.5       )
							(-0.89981043 -0.05061325  0.5       )
							(-0.89205297 -0.05151975  0.5       )
							(-0.88415256 -0.0523155   0.5       )
							(-0.87611876 -0.05300413  0.5       )
							(-0.86796018 -0.05358929  0.5       )
							(-0.85968452 -0.05407464  0.5       )
							(-0.85129863 -0.05446381  0.5       )
							(-0.84280853 -0.05476044  0.5       )
							(-0.83421949 -0.05496817  0.5       )
							(-0.82553603 -0.05509061  0.5       )
							(-0.81676201 -0.05513133  0.5       )
							(-0.80790063 -0.0550939   0.5       )
							(-0.79895448 -0.05498186  0.5       )
							(-0.78992562 -0.05479868  0.5       )
							(-0.78081555 -0.05454784  0.5       )
							(-0.77162531 -0.05423272  0.5       )
							(-0.7623555  -0.05385669  0.5       )
							(-0.75300628 -0.05342307  0.5       )
							(-0.74357747 -0.0529351   0.5       )
							(-0.73406853 -0.05239597  0.5       )
							(-0.72447862 -0.05180881  0.5       )
							(-0.71480665 -0.0511767   0.5       )
							(-0.70505128 -0.05050263  0.5       )
							(-0.69521095 -0.04978953  0.5       )
							(-0.68528395 -0.04904024  0.5       )
							(-0.67526843 -0.04825755  0.5       )
							(-0.66516241 -0.04744415  0.5       )
							(-0.65496384 -0.04660267  0.5       )
							(-0.64467061 -0.04573564  0.5       )
							(-0.63428058 -0.04484552  0.5       )
							(-0.62379163 -0.04393467  0.5       )
							(-0.61320162 -0.04300538  0.5       )
							(-0.60250851 -0.04205984  0.5       )
							(-0.59171031 -0.04110015  0.5       )
							(-0.58080513 -0.04012833  0.5       )
							(-0.5697912 -0.0391463  0.5      )
							(-0.5586669  -0.03815591  0.5       )
							(-0.54743077 -0.03715888  0.5       )
							(-0.53608152 -0.03615687  0.5       )
							(-0.52461808 -0.03515143  0.5       )
							(-0.51303961 -0.03414404  0.5       )
							(-0.50134549 -0.03313607  0.5       )
							(-0.48953537 -0.03212881  0.5       )
							(-0.47760917 -0.03112344  0.5       )
							(-0.46556709 -0.03012107  0.5       )
							(-0.45340966 -0.02912273  0.5       )
							(-0.4411377  -0.02812933  0.5       )
							(-0.42875238 -0.02714172  0.5       )
							(-0.4162552  -0.02616066  0.5       )
							(-0.40364803 -0.02518682  0.5       )
							(-0.3909331 -0.0242208  0.5      )
							(-0.378113   -0.02326311  0.5       )
							(-0.36519073 -0.02231419  0.5       )
							(-0.35216967 -0.02137439  0.5       )
							(-0.3390536  -0.02044402  0.5       )
							(-0.32584673 -0.01952328  0.5       )
							(-0.31255365 -0.01861233  0.5       )
							(-0.2991794  -0.01771127  0.5       )
							(-0.28572941 -0.01682011  0.5       )
							(-0.27220959 -0.01593883  0.5       )
							(-0.25862622 -0.01506734  0.5       )
							(-0.24498605 -0.01420551  0.5       )
							(-0.23129627 -0.01335316  0.5       )
							(-0.21756447 -0.01251006  0.5       )
							(-0.2037987  -0.01167594  0.5       )
							(-0.19000744 -0.01085052  0.5       )
							(-0.1761996  -0.01003347  0.5       )
							(-0.16238451 -0.00922442  0.5       )
							(-0.14857194 -0.00842301  0.5       )
							(-0.13477206 -0.00762885  0.5       )
							(-0.12099548 -0.00684154  0.5       )
							(-0.1072532  -0.00606067  0.5       )
							(-0.09355663 -0.00528585  0.5       )
							(-0.07991758 -0.00451666  0.5       )
							(-0.06634825 -0.00375273  0.5       )
							(-0.0528612  -0.00299369  0.5       )
							(-0.03946938 -0.0022392   0.5       )
							(-0.02618609 -0.00148892  0.5       )
							(-0.01302497 -0.0007426   0.5       )

						)
);

boundary
(
    inOut
    {
        type patch;
        faces
        (
            ( 6  4  5  7)
            ( 6  8  9  7)
            ( 10 12 13 11 )
            ( 12 14 15 13 )
            ( 4 14 15  5 )
            ( 8 10 11  9 )
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 0  2  3  1)
            ( 0 16 17  1)
        );
    }
    interface1
    {
        type patch;
        faces
        (
            ( 2 12 13  3)
        );
    }

    interface2
    {
        type patch;
        faces
        (
            (16 12 13 17)
        );
    }
);

mergePatchPairs
(
    (interface1 interface2)
);
