bezier_foil/0/bk/U
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				volVectorField;
		location		"0";
		object			U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alpha						0.0;						 // AoA in Degrees
U 							35; 					// Flow magnitude


dimensions			[0 1 -1 0 0 0 0];

internalField		uniform  (#calc "$U * cos(degToRad($alpha))" #calc "$U*sin(degToRad($alpha))"  0);


boundaryField
{
		down
		{
				type						zeroGradient;
		}

		right
		{
				type						zeroGradient;
		}

		up
		{
				type						zeroGradient;
		}

		meanFlow
		{
				type						inletOutlet;
				inletValue		  uniform (#calc "$U * cos(degToRad($alpha))" #calc "$U*sin(degToRad($alpha))"  0);
		}

		surface
		{
				type						noSlip;
		}


		defaultFaces
		{
				type						empty;
		}
}

// ************************************************************************* //
